<template>
    <div class="userPolicy-container">
        <van-sticky :offset-top="0">
            <van-nav-bar class="nav-bar-main"
                         left-arrow
                         title="用户协议" @click-left="com_goto('login', {activeName: 'register'})"></van-nav-bar>
        </van-sticky>
       <div class="content">
           <h3>请仔细阅读并同意以下用户协议：</h3><br/>

           首先感谢您使用《姑墨交通出行》的产品和服务。本协议是用户（下称“您”），包括注册用户及没注册的访客（访客适用部分条款的约束），以注册、访问或浏览方式使用《姑墨交通出行》的产品和服务时与我们签署的协议（以下提到《姑墨交通出行》时即指该产品）。

           请留意：您对《姑墨交通出行》网页、产品和服务的使用即视为对本协议的签署，具有法律约束力。

            

           重要须知---在签署本协议之前，《姑墨交通出行》正式提醒用户：

           您应认真阅读、充分理解本本协议以及本协议中各条款以及涉及到的隐私政策，当中可能包括免除或者限制《姑墨交通出行》责任或对用户权利限制的条款。除非您接受本协议，否则您无权也无必要继续接受《姑墨交通出行》的产品及服务。您可以退出用户注册页面或停止使用《姑墨交通出行》的产品及服务。您点击“同意”接受并继续使用《姑墨交通出行》的产品及服务，视为您已完全接受本协议。在您签署本协议之后，此文本可能因国家政策、产品以及履行本协议的环境发生变化而多次进行修改。修改后的协议发布在本网站上，若您对修改后的协议有异议的，请立即停止登录账户及停止使用《姑墨交通出行》产品和服务，若您登录或继续使用，将视为对修改后的协议予以认可。

            

            

           <p>1、服务条款的确认和接纳</p>

            

           本网站及APP的各项内容和服务的所有权归本公司拥有。用户在接受本服务之前，请务必仔细阅读本条款。用户使用服务，或通过完成注册程序，表示用户接受所有服务条款。

            

           <p>2、用户同意：</p>

            

           (1) 提供及时、详尽及准确的个人资料。<br>

            

           (2) 不断更新注册资料、符合及时、详尽、准确的要求。如果用户提供的资料不准确，本网站有结束服务的权利。本网站及APP将不公开用户的姓名、地址、电子邮箱、帐号和电话号码等信息（请阅隐私保护条款）。<br>

            

           用户在本网站和APP的任何行为必须遵循：<br>

            

           (1) 传输资料时必须符合中国有关法规。<br>

            

           (2) 使用信息服务不作非法用途和不道德行为。<br>

            

           (3) 不干扰或混乱网络服务。<br>

            

           (4) 遵守所有使用服务的网络协议、规定、程序和惯例。用户的行为准则是以因特网法规，政策、程序和惯例为根据的。<br>

            

           3、服务条款的修改<br>

            

           本网站及APP有权在必要时修改条款，将会在页面公布。如果不接受所改动的内容，用户可以主动取消自己的会员资格。如果您不取消自己的会员资格，则视为接受服务条款的变动。<br>

            

           4、 用户的帐号、密码和安全性<br>

            

           一旦成功注册成为会员，您将有一个密码和用户名。用户将对用户名和密码的安全负全部责任。另外，每个用户都要对以其用户名进行的所有活动和事件负全责。您可以随时改变您的密码。用户若发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通告本公司。<br>

            

           5、拒绝提供担保<br>

            

           用户明确同意使用本公司服务，由用户个人承担风险。本网站及APP不担保服务一定满足用户的要求，也不担保服务不会中断，对服务的及时性、安全性、出错发生都不作担保。用户理解并接受：任何通过服务取得的信息资料的可靠性有用性取决于用户自己的判断，用户自己承担所有风险和责任。<br>

            

           6、有限责任<br>

            

           本网站及APP对任何由于使用服务引发的直接、间接、偶然及继起的损害不负责任。这些损害可能来自（包括但不限于）：不正当使用服务，或传送的信息不符合规定等。<br>

            

           7、对用户信息的存储和限制<br>

            

           本网站及APP不对用户发布信息的删除或储存失败负责，本公司有判定用户的行为是否符合服务条款的要求和精神的保留权利。如果用户违背了服务条款的规定，有中断对其提供服务的权利。<br>

            

           8、结束服务<br>

            

           本网站及APP可随时根据实际情况中断一项或多项服务，不需对任何个人或第三方负责或知会。同时用户若反对任何服务条款的建议或对后来的条款修改有异议，或对服务不满，用户可以行使如下权利：<br>

            

           (1) 不再使用本公司的服务。<br>

            

           (2) 通知本公司停止对该用户的服务。<br>

            

           9、信息内容的所有权<br>

            

           本公司的信息内容包括：文字、软件、声音、相片、录象、图表；以及其它信息，所有这些内容受版权、商标、标签和其它财产所有权法律的保护。用户只能在授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。<br>

            

           10、隐私保护条款<br>

            

           隐私政策<br>

           本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。 您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本应用服务使用协议不可分割的一部分。<br>

            

               适用范围<br>

               (a) 在您注册本应用帐号时，您根据本应用要求提供的个人注册信息；

               <br>(b) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；

               <br>© 本应用通过合法途径从商业伙伴处取得的用户个人数据。

               <br>您了解并同意，以下信息不适用本隐私权政策：

               <br>(a) 您在使用本应用平台提供的搜索服务时输入的关键字信息；

               <br>(b) 本应用收集到的您在本应用发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；

               <br>© 违反法律规定或违反本应用规则行为及本应用已对您采取的措施。

               <br>信息使用

               <br>(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本应用（含本应用关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。

               <br>(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。

              <br> © 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。

               <br>信息披露

               <br>在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：

               <br>(a) 经您事先同意，向第三方披露；

               <br>(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；

               <br>© 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；

               <br>(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；

               <br>(e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；

               <br>(f) 在本应用平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，本应用有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。

               <br>(g) 其它本应用根据法律、法规或者网站政策认为合适的披露。

               <br>信息存储和交换

               <br>本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。

               Cookie的使用

               <br>(a) 在您未拒绝接受cookies的情况下，本应用会在您的计算机上设定或取用cookies ，以便您能登录或使用依赖于cookies的本应用平台服务或功能。本应用使用cookies可为您提供更加周到的个性化服务，包括推广服务。

               <br>(b) 您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本应用网络服务或功能。

               <br>© 通过本应用所设cookies所取得的有关信息，将适用本政策。

              <br> 信息安全

               <br>(a) 本应用帐号均有安全保护功能，请妥善保管您的用户名及密码信息。本应用将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。

               <br>(b) 在使用本应用网络服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对

               <br>7.本隐私政策的更改

               <br>(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。

               <br>(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。

               <br>请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。防止个人信息泄密，尤其是本应用用户名及密码。

            

           <br>11、适用法律

            

           <br>上述条款将适用中华人民共和国的法律，所有的争端将诉诸于本网所在地的人民法院。如发生服务条款与中华人民共和国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它条款则依旧保持约束力。

       </div>
    </div>
</template>

<script>
    import comMixin from '../../../lib/mixins/comMixin';
    export default {
        name: 'userPolicy',
        mixins: [comMixin],
        data() {
            return {}
        }
    }
</script>

<style lang="scss" scoped>
    .userPolicy-container {
        .content {
            padding: 16px;
        }
    }
</style>
